'''
Строки - 50б.
1) Преобразование регистра: Напишите программу, которая запрашивает у пользователя строку
и преобразует её к верхнему или нижнему регистру в зависимости от выбора пользователя.
'''
# text = input('Введите текст: ')
# result = text.upper()
# print(result)

'''
Строки - 50б.
2) Слияние строк: Напишите программу, которая запрашивает у пользователя две строки
и объединяет их в одну, разделяя пробелом.
'''
# text1 = input('Введите текст: ')
# text2 = input('Введите текст: ')
# print(f'{text1} {text2}')
'''
Строки - 50б.
3) Подсчёт символов: Напишите программу, которая запрашивает у пользователя строку
и выводит количество символов в ней.
'''
# text = input('Введите текст: ')
# result = len(text)
# print(f'Кол-во символов: {result}')
'''
Строки - 50б.
4) Переворот строки: Напишите программу, которая запрашивает у пользователя строку
и выводит её в обратном порядке.
'''
# text = input('Введите текст: ')
# print(text[::-1])

###################################################

'''
Списки - 50б.
1) Сумма чисел: Создайте список чисел и вычислите их сумму.
'''
# nums = [1, 2, 3, 4, 5, 6]
# result = sum(nums)
# print('Сумма элементов: ', result)

'''
Списки - 50б.
2) Нахождение максимального и минимального чисел: Создайте список чисел
и найдите в нем максимальное и минимальное числа.
'''
# nums = [1, 2, 3, 4, 5, 6]
# print('максимальное: ', max(nums))
# print('минимальное: ', min(nums))
'''
Списки - 50б.
3) Объединение списков: Создайте два списка и объедините их в один.
'''
# nums = [1, 2, 3, 4, 5, 6]
# list = [1, 2, 3, 'Apple', 5, -6, 78, 'Banana', 9.1]
# nums.extend(list)
# print(nums)
'''
Списки - 50б.
4) Удаление дубликатов: Создайте список с повторяющимися элементами
и удалите из него дубликаты.
'''
# list = [5, 7, 4, 3, 5, 5, 532, True, 4, 6, 5, 5]
# result = set(list)
# print(result)
